package top.cheungchingyin.entties;

import java.util.Random;

import top.cheungchingyin.listener.ShapeListener;

public class ShapeFactory {
	
	private int shapes[][][]=new int[][][]{
		{//反向L字形
			{
				1,1,1,0,	0,0,1,0,
				0,0,0,0,	0,0,0,0
			},
			{
				0,1,0,0,	0,1,0,0,
				1,1,0,0,	0,0,0,0,
			},
			{
				1,0,0,0,	1,1,1,0,
				0,0,0,0,	0,0,0,0,
			},
			{
				1,1,0,0,	1,0,0,0,
				1,0,0,0,	0,0,0,0,
			}
			
		},
		{//L字形
			{
				1,1,1,0,	1,0,0,0,
				0,0,0,0,	0,0,0,0,
			},
			{
				1,1,0,0,	0,1,0,0,
				0,1,0,0,	0,0,0,0,
			},
			{
				0,0,1,0,	1,1,1,0,
				0,0,0,0,	0,0,0,0,
			},
			{
				1,0,0,0,	1,0,0,0,
				1,1,0,0,	0,0,0,0,
			}
		},
		{//田字型
			{
				1,1,0,0,	1,1,0,0,
				0,0,0,0,	0,0,0,0,
			}
		},
		{//Z字形
			{
				1,1,0,0,	0,1,1,0,
				0,0,0,0,	0,0,0,0,
			},
			{
				0,1,0,0,	1,1,0,0,
				1,0,0,0,	0,0,0,0,
			}
		},
		{//反向Z
			{
				0,1,1,0,	1,1,0,0,
				0,0,0,0,	0,0,0,0,
			},
			{
				1,0,0,0,	1,1,0,0,
				0,1,0,0,	0,0,0,0,
			}
		},
		{//凸字形
			{
				0,1,0,0,	1,1,1,0,
				0,0,0,0,	0,0,0,0,
			},
			{
				1,0,0,0,	1,1,0,0,
				1,0,0,0,	0,0,0,0,
			},
			{
				1,1,1,0,	0,1,0,0,
				0,0,0,0,	0,0,0,0,
			},
			{
				0,1,0,0,	1,1,0,0,
				0,1,0,0,	0,0,0,0,
			}
		},
		{//1字形
			{
				1,1,1,1,	0,0,0,0,
				0,0,0,0,	0,0,0,0,
			},
			{
				1,0,0,0,	1,0,0,0,
				1,0,0,0,	1,0,0,0,
			}
		}
	};

	public Shape getShape(ShapeListener listener){
		System.out.println("ShapeFactory's getShape");
		Shape shape=new Shape();
		shape.addShapeListener(listener);//应用形状监听器
		int type = new Random().nextInt(shapes.length);//随机生成形状相应的数字
		shape.setBody(shapes[type]);//生成那一类型的形状，如L，反L，田型等等的形状
		shape.setStatus(0);//设置图形的状态
		return shape;//放回生成的形状
		
	}
}
